import numpy as np

data = ([5, 8, 9, 5])  # заполнение файла с начальными значениями - M, N, a, b
np.save('saved_data', data)


def fumc1():
    M, N, a, b = np.load('saved_data.npy')  # загружаем входные данные из файла

    x = np.zeros((M, N), dtype=int)  # с помощью функции zeros из библиотеки numpy создаем матрицу

    x[1::2, ::2] = a   # начиная со 2й строки через 2 заменяем каждый первый элемент на 'a'
    x[::2, 1::2] = a   # начиная с  1й строки через 2 заменяем каждый второй элемент на 'a'

    x[::2, ::2] = b    # начиная с  1й строки через 2 заменяем каждый первый элемент на 'b'
    x[1::2, 1::2] = 1  # начиная со 2й строки через 2 заменяем каждый второй элемент на 'b'

    np.save("matrix", x)  # сохраняем результат в файл

    print(x)


if __name__ == '__main__':
    fumc1()
